levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_usart.c
#define IS_USART_SILENCE_MODE(x)                                               \
(   (USART_UART_NORMAL_MODE == (x))             ||                             \
    (USART_UART_SILENCE_MODE == (x)))

#define IS_USART_CLOCK_MODE(x)                                                 \
(   (USART_EXTCLK == (x))                       ||                             \
    (USART_INTCLK_OUTPUT == (x))                ||                             \
    (USART_INTCLK_NONE_OUTPUT == (x)))

#define IS_USART_STOP_BITS(x)                                                  \
(   (USART_STOP_BITS_1 == (x))                  ||                             \
    (USART_STOP_BITS_2 == (x)))

#define IS_UART_DUPLEX_MODE(x)                                                 \
(   (USART_HALFDUPLEX_MODE == (x))              ||                             \
    (USART_FULLDUPLEX_MODE == (x)))

#define IS_USART_HWFLOWCTRL(x)                                                 \
(   (USART_HWFLOWCTRL_CTS == (x))               ||                             \
    (USART_HWFLOWCTRL_RTS == (x)))

#define IS_USART_CLOCK_PRESCALER_DIV(x)                                        \
(   (USART_CLK_PRESCALER_DIV1 == (x))           ||                             \
    (USART_CLK_PRESCALER_DIV4 == (x))           ||                             \
    (USART_CLK_PRESCALER_DIV16 == (x))          ||                             \
    (USART_CLK_PRESCALER_DIV64 == (x)))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/** 
 * @defgroup USART_Global_Functions USART Global Functions
 * @{
 */

/**
 * @brief  Initialize UART function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_uart_init_t structure (USARTx unit UART function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance or pstcInit == NULL
 */
en_result_t USART_UartInit(M4_USART_TypeDef *USARTx,
                            const stc_uart_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance and pstcInit */
    if ((IS_USART_INSTANCE(USARTx)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_STOP_BITS(pstcInit->u32StopBit));
        DDL_ASSERT(IS_USART_CLOCK_MODE(pstcInit->u32ClkMode));
        DDL_ASSERT(IS_USART_DATA_WIDTH(pstcInit->u32DataWidth));
        DDL_ASSERT(IS_USART_HWFLOWCTRL(pstcInit->u32HwFlowCtrl));
        DDL_ASSERT(IS_USART_PARITY_CONTROL(pstcInit->u32Parity));
        DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(pstcInit->u32BitDirection));
        DDL_ASSERT(IS_USART_NOISE_FILTER(pstcInit->u32NoiseFilterState));
        DDL_ASSERT(IS_USART_CLOCK_PRESCALER_DIV(pstcInit->u32ClkPrescaler));
        DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(pstcInit->u32OversamplingBits));
        DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(pstcInit->u32SbDetectPolarity));

        /* Disbale TX/RX && clear interrupt flag */
        WRITE_REG32(USARTx->CR1, (USART_CR1_CPE | USART_CR1_CFE | USART_CR1_CORE));

        /* Set CR1 */
        MODIFY_REG32(USARTx->CR1,
                     (USART_CR1_SLME | USART_CR1_PS | USART_CR1_PCE |          \
                      USART_CR1_M | USART_CR1_OVER8 | USART_CR1_MS |           \
                      USART_CR1_ML | USART_CR1_NFE | USART_CR1_SBS),           \
                     (USART_MODE_UART | pstcInit->u32Parity | pstcInit->u32DataWidth | \
                      pstcInit->u32OversamplingBits | pstcInit->u32BitDirection      | \
                      pstcInit->u32NoiseFilterState | pstcInit->u32SbDetectPolarity));

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, (pstcInit->u32ClkMode | pstcInit->u32StopBit));

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, pstcInit->u32HwFlowCtrl);

        /* Set PR */
        WRITE_REG32(USARTx->PR, pstcInit->u32ClkPrescaler);

        /* Set baudrate */
        enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
    }

    return enRet;
}

/**
 * @brief  Initialize UART half dulplex function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_uart_init_t structure (USARTx unit UART half dulplex function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance or pstcInit == NULL
 */
en_result_t USART_HalfDuplexInit(M4_USART_TypeDef *USARTx,
                                            const stc_uart_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

