levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_usart.c
        /* Disbale TX/RX && clear interrupt flag */
        WRITE_REG32(USARTx->CR1, (USART_CR1_CPE | USART_CR1_CFE | USART_CR1_CORE));

        /* Set CR1 */
        MODIFY_REG32(USARTx->CR1,
                     (USART_CR1_SLME | USART_CR1_PS | USART_CR1_PCE |          \
                      USART_CR1_M | USART_CR1_OVER8 | USART_CR1_MS  |          \
                      USART_CR1_ML | USART_CR1_NFE | USART_CR1_SBS),           \
                     (USART_MODE_CLKSYNC | pstcInit->u32BitDirection));

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, pstcInit->u32ClkMode);

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, pstcInit->u32HwFlowCtrl);

        /* Set PR */
        WRITE_REG32(USARTx->PR, pstcInit->u32ClkPrescaler);

        /* Set baudrate */
        enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_clksync_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_clksync_init_t structure (USARTx unit CLKSYNC function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit == NULL
 */
en_result_t USART_ClkSyncStructInit(stc_clksync_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameter */
    if (NULL != pstcInit)
    {
        pstcInit->u32Baudrate = 9600UL;
        pstcInit->u32ClkMode = USART_INTCLK_NONE_OUTPUT;
        pstcInit->u32ClkPrescaler = USART_CLK_PRESCALER_DIV1;
        pstcInit->u32BitDirection = USART_LSB;
        pstcInit->u32HwFlowCtrl = USART_HWFLOWCTRL_RTS;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize USART function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_DeInit(M4_USART_TypeDef *USARTx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG32(USARTx->CR1, (USART_CR1_CPE | USART_CR1_CFE | USART_CR1_CORE));
        WRITE_REG32(USARTx->PR, 0x00000000UL);
        WRITE_REG32(USARTx->BRR, 0x0000FF00UL);
        WRITE_REG32(USARTx->CR1, 0x80000000UL);
        WRITE_REG32(USARTx->CR2, 0x00000000UL);
        WRITE_REG32(USARTx->CR3, 0x00000000UL);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable/disable USART Transmit/Receive Function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_RX:             USART RX function
 *           @arg USART_TX:             USART TX function
 *           @arg USART_INT_RX:         USART RX interrupt function
 *           @arg USART_INT_TC:         USART transmission complete interrupt
 *           @arg USART_INT_TXE:        Transmit data register empty interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_FuncCmd(M4_USART_TypeDef *USARTx,
                            uint32_t u32Func,
                            en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));
        DDL_ASSERT(IS_USART_TRANSMIT_RECEIVE_FUNCTION(u32Func));

        (Enable == enNewSta) ? SET_REG32_BIT(USARTx->CR1, u32Func) : CLEAR_REG32_BIT(USARTx->CR1, u32Func);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART interrupt state.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be one of the following values:
 *           @arg USART_TX:             USART TX function
 *           @arg USART_INT_RX:         USART RX interrupt function
 *           @arg USART_INT_TC:         USART transmission complete interrupt
 *           @arg USART_INT_TXE:        Transmit data register empty interrupt
 * @retval An en_functional_state_t enumeration value:
 *           - Enable: Enable function
 *           - Disable: Disable function
 */
en_functional_state_t USART_GetFuncState(M4_USART_TypeDef *USARTx,
                            uint32_t u32Func)
{
    /* Check parameters */
    DDL_ASSERT (IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_TRANSMIT_RECEIVE_FUNCTION(u32Func));

    return (READ_REG32_BIT(USARTx->CR1, u32Func) ? Enable : Disable);
}

/**
 * @brief  Get USART flag.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Flag                 USART flag type
 *         This parameter can be one of the following values:
 *           @arg USART_FLAG_PE:        Parity error flag
 *           @arg USART_FLAG_FE:        Framing error flag
 *           @arg USART_FLAG_ORE:       Overrun error flag
 *           @arg USART_FLAG_RXNE:      Receive data register not empty flag
 *           @arg USART_FLAG_TC:        Transmission complete flag
 *           @arg USART_FLAG_TXE:       Transmit data register empty flag
 *           @arg USART_FLAG_MPB:       Receive processor ID flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t USART_GetFlag(M4_USART_TypeDef *USARTx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_FLAG(u32Flag));

    return (READ_REG32_BIT(USARTx->SR, u32Flag) ? Set : Reset);
}

/**
 * @brief  Get USART flag.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Flag                 USART flag type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_CLEAR_FLAG_PE:  Clear Parity error flag
 *           @arg USART_CLEAR_FLAG_FE:  Clear Framing error flag
 *           @arg USART_CLEAR_FLAG_ORE: Clear Overrun error flag
 * @retval An en_result_t enumeration value:
 *           - Ok: Clear successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_ClearFlag(M4_USART_TypeDef *USARTx, uint32_t u32Flag)
{
    en_result_t enRet = ErrorInvalidParameter;

