levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_usart.c
    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_CLEAR_FLAG(u32Flag));

        SET_REG32_BIT(USARTx->CR1, u32Flag);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set USART silence mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SilenceModeCmd(M4_USART_TypeDef *USARTx, en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        (Enable == enNewSta) ? SET_REG32_BIT(USARTx->CR1, USART_CR1_SLME) : CLEAR_REG32_BIT(USARTx->CR1, USART_CR1_SLME);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART silence mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg Enable:               UART silence mode
 *           @arg Disable:              UART normal mode
 */
en_functional_state_t USART_GetSilenceModeState(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_SLME) ? Enable : Disable;
}

/**
 * @brief  Set USART transmission type.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Type                 USART transmission content type
 *         This parameter can be one of the following values:
 *           @arg USART_TRANSMISSION_ID     USART transmission content type is processor ID
 *           @arg USART_TRANSMISSION_DATA   USART transmission content type is frame data
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetTransmissionType(M4_USART_TypeDef *USARTx, uint32_t u32Type)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_TRANSMISSION_TYPE(u32Type));

        MODIFY_REG32(USARTx->DR, USART_DR_MPID, u32Type);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART transmission type.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_TRANSMISSION_ID     USART transmission content type is processor ID
 *           @arg USART_TRANSMISSION_DATA   USART transmission content type is frame data
 */
uint32_t USART_GetTransmissionType(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->DR, USART_DR_MPID);
}

/**
 * @brief  Set USART parity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Parity               USART parity
 *         This parameter can be one of the following values:
 *           @arg USART_PARITY_NONE:    Parity control disabled
 *           @arg USART_PARITY_ODD:     Parity control enabled and Odd Parity is selected
 *           @arg USART_PARITY_EVEN:    Parity control enabled and Even Parity is selected
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetParity(M4_USART_TypeDef *USARTx, uint32_t u32Parity)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_PARITY_CONTROL(u32Parity));

        MODIFY_REG32(USARTx->CR1, (USART_CR1_PS | USART_CR1_PCE), u32Parity);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART parity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_PARITY_NONE:    Parity control disabled
 *           @arg USART_PARITY_ODD:     Parity control enabled and Odd Parity is selected
 *           @arg USART_PARITY_EVEN:    Parity control enabled and Even Parity is selected
 */
uint32_t USART_GetParity(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, (USART_CR1_PS | USART_CR1_PCE));
}

/**
 * @brief  Set USART data width.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32DataWidth            USART data width
 *         This parameter can be one of the following values:
 *           @arg USART_DATA_WIDTH_BITS_8:  8 bits word length : Start bit, 8 data bits, n stop bits
 *           @arg USART_DATA_WIDTH_BITS_9:  9 bits word length : Start bit, 9 data bits, n stop bits
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetDataWidth(M4_USART_TypeDef *USARTx, uint32_t u32DataWidth)
{
    en_result_t enRet = ErrorInvalidParameter;

