levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_usart.c
    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_DATA_WIDTH(u32DataWidth));

        MODIFY_REG32(USARTx->CR1, USART_CR1_M, u32DataWidth);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART data width.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_DATA_WIDTH_BITS_8:  8 bits word length : Start bit, 8 data bits, n stop bits
 *           @arg USART_DATA_WIDTH_BITS_9:  9 bits word length : Start bit, 9 data bits, n stop bits
 */
uint32_t USART_GetDataWidth(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_M);
}

/**
 * @brief  Set USART oversampling bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32OversamplingBits     USART oversampling bits
 *         This parameter can be one of the following values:
 *           @arg USART_OVERSAMPLING_BITS_8:    Oversampling by 8 bits
 *           @arg USART_OVERSAMPLING_BITS_16:   Oversampling by 16 bits
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetOversmaplingBits(M4_USART_TypeDef *USARTx, uint32_t u32OversamplingBits)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(u32OversamplingBits));

        MODIFY_REG32(USARTx->CR1, USART_CR1_OVER8, u32OversamplingBits);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART oversampling bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_OVERSAMPLING_BITS_8:    Oversampling by 8 bits
 *           @arg USART_OVERSAMPLING_BITS_16:   Oversampling by 16 bits
 */
uint32_t USART_GetOversmaplingBits(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_OVER8);
}

/**
 * @brief  Set USART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Mode                 USART mode
 *         This parameter can be one of the following values:
 *           @arg USART_MODE_UART:      UART mode
 *           @arg USART_MODE_CLKSYNC:   Clock synchronization
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetMode(M4_USART_TypeDef *USARTx, uint32_t u32Mode)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_MODE_SEL(u32Mode));

        MODIFY_REG32(USARTx->CR1, USART_CR1_MS, u32Mode);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_MODE_UART:      UART mode
 *           @arg USART_MODE_CLKSYNC:   Clock synchronization
 */
uint32_t USART_GetMode(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_MS);
}

/**
 * @brief  Set USART bit direction.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32BitDir               USART bit direction
 *         This parameter can be one of the following values:
 *           @arg USART_MSB:            MSB(Most Significant Bit)
 *           @arg USART_LSB:            LSB(Least Significant Bit)
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance
 */
en_result_t USART_SetBitDirection(M4_USART_TypeDef *USARTx,
                                        uint32_t u32BitDir)
{
    en_result_t enRet = ErrorInvalidParameter;

