levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_usart.c
    /* Check USARTx instance */
    if (IS_USART_INSTANCE(USARTx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_CLOCK_PRESCALER_DIV(u32PrescalerDiv));

        MODIFY_REG32(USARTx->PR, USART_PR_PSC, u32PrescalerDiv);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get USART clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_CLK_PRESCALER_DIV1:     PCLK
 *           @arg USART_CLK_PRESCALER_DIV4:     PCLK/4
 *           @arg USART_CLK_PRESCALER_DIV16:    PCLK/16
 *           @arg USART_CLK_PRESCALER_DIV64:    PCLK/64
 */
uint32_t USART_GetClkPrescaler(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->PR, USART_PR_PSC);
}

/**
 * @brief  Set USART baudrate.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [in] pf32Err                 E(%) baudrate error rate
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: USARTx is invalid instance or DIV_Integer is out of range
 */
en_result_t USART_SetBaudrate(M4_USART_TypeDef *USARTx,
                                    uint32_t u32Baudrate,
                                    float32_t *pf32Err)
{
    uint32_t B = 0UL;
    uint32_t C = 0UL;
    uint32_t OVER8 = 0UL;
    uint32_t DIV_Integer = 0UL;
    uint32_t u32Temp = 0UL;
    uint32_t u32Prescaler = 0UL;
    uint32_t u32Mode = READ_REG32_BIT(USARTx->CR1, USART_CR1_MS);
    en_result_t enRet = ErrorInvalidParameter;

    /* Check USARTx pointer */
    if (IS_USART_INSTANCE(USARTx) && u32Baudrate)
    {
        u32Prescaler = READ_REG32_BIT(USARTx->PR, USART_PR_PSC);

        B = u32Baudrate;
        C = (SystemCoreClock / (1UL << (u32Prescaler * 2UL)));
        OVER8 = READ_REG32_BIT(USARTx->CR1, USART_CR1_OVER8) ? 1UL : 0UL;

        if (USART_MODE_UART == u32Mode)
        {
            /* UART Baudrate Calculation Formula */
            /* B = C / (8 * (2 - OVER8) * (DIV_Integer + 1)) */
            DIV_Integer = (C * 10UL) / (B * 8UL * (2UL - OVER8));
        }
        else
        {
            /* Clock Sync Baudrate Calculation Formula */
            /* B = C / (4 * (DIV_Integer + 1)) */
            DIV_Integer = (C * 10UL) / (B * 4UL);
        }

        if (DIV_Integer % 10UL < 5UL)
        {
            DIV_Integer -= 10UL;
        }

        DIV_Integer /= 10UL;

        if (DIV_Integer <= 0xFFul)
        {
            if (pf32Err)
            {
                if (USART_MODE_UART == u32Mode)
                {
                    /* UART Baudrate Error Calculation Formula */
                    /* E(%) = C / (8 * (2 - OVER8) * (DIV_Integer + 1) * B) - 1 */
                    u32Temp = (8UL * (2UL - OVER8) * (DIV_Integer + 1UL) * B);
                }
                else
                {
                    /* Clock Sync Baudrate Error Calculation Formula */
                    /* E(%) = C / (4 * (DIV_Integer + 1) * B) - 1 */
                    u32Temp = (4UL * (DIV_Integer + 1UL) * B);
                }

                *pf32Err = (float32_t)(((float64_t)C) / (float64_t)u32Temp) - 1.0f;
            }

            /* Set USART_BRR register bits:DIV_Integer */
            WRITE_REG32(USARTx->BRR, (DIV_Integer << USART_BRR_DIV_INTEGER_POS));
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @}
 */

#endif /* DDL_USART_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
